AdrianoCarosso/testkit/TestKit-r02-src/driver/_LPC1788.h
#ifndef __LPC177x_8x_H__
#define __LPC177x_8x_H__

/********************************************************************
* Power Control for Peripherals Definitions
**********************************************************************/
/** LCD controller power/clock control bit */
#define CLKPWR_PCONP_PCLCD      ((uint32_t)(1<<0))

/** Timer/Counter 0 power/clock control bit */
#define CLKPWR_PCONP_PCTIM0     ((uint32_t)(1<<1))

/* Timer/Counter 1 power/clock control bit */
#define CLKPWR_PCONP_PCTIM1     ((uint32_t)(1<<2))

/** UART0 power/clock control bit */
#define CLKPWR_PCONP_PCUART0    ((uint32_t)(1<<3))

/** UART1 power/clock control bit */
#define CLKPWR_PCONP_PCUART1    ((uint32_t)(1<<4))

/** PWM0 power/clock control bit */
#define CLKPWR_PCONP_PCPWM0     ((uint32_t)(1<<5))

/** PWM1 power/clock control bit */
#define CLKPWR_PCONP_PCPWM1     ((uint32_t)(1<<6))

/** The I2C0 interface power/clock control bit */
#define CLKPWR_PCONP_PCI2C0     ((uint32_t)(1<<7))

/** UART4 power/clock control bit */
#define CLKPWR_PCONP_PCUART4    ((uint32_t)(1<<8))

/** The RTC power/clock control bit */
#define CLKPWR_PCONP_PCRTC      ((uint32_t)(1<<9))

/** The SSP1 interface power/clock control bit */
#define CLKPWR_PCONP_PCSSP1     ((uint32_t)(1<<10))

/** External Memory controller power/clock control bit */
#define CLKPWR_PCONP_PCEMC      ((uint32_t)(1<<11))

/** A/D converter 0 (ADC0) power/clock control bit */
#define CLKPWR_PCONP_PCADC      ((uint32_t)(1<<12))

/** CAN Controller 1 power/clock control bit */
#define CLKPWR_PCONP_PCAN1      ((uint32_t)(1<<13))

/** CAN Controller 2 power/clock control bit */
#define CLKPWR_PCONP_PCAN2  ((uint32_t)(1<<14))

/** GPIO power/clock control bit */
#define CLKPWR_PCONP_PCGPIO     ((uint32_t)(1<<15))

/** Motor Control PWM */
#define CLKPWR_PCONP_PCMCPWM    ((uint32_t)(1<<17))

/** Quadrature Encoder Interface power/clock control bit */
#define CLKPWR_PCONP_PCQEI      ((uint32_t)(1<<18))

/** The I2C1 interface power/clock control bit */
#define CLKPWR_PCONP_PCI2C1     ((uint32_t)(1<<19))

/** The SSP2 interface power/clock control bit */
#define CLKPWR_PCONP_PCSSP2     ((uint32_t)(1<<20))

/** The SSP0 interface power/clock control bit */
#define CLKPWR_PCONP_PCSSP0     ((uint32_t)(1<<21))

/** Timer 2 power/clock control bit */
#define CLKPWR_PCONP_PCTIM2 ((uint32_t)(1<<22))

/** Timer 3 power/clock control bit */
#define CLKPWR_PCONP_PCTIM3 ((uint32_t)(1<<23))

/** UART 2 power/clock control bit */
#define CLKPWR_PCONP_PCUART2    ((uint32_t)(1<<24))

/** UART 3 power/clock control bit */
#define CLKPWR_PCONP_PCUART3    ((uint32_t)(1<<25))

/** I2C interface 2 power/clock control bit */
#define CLKPWR_PCONP_PCI2C2 ((uint32_t)(1<<26))

/** I2S interface power/clock control bit*/
#define CLKPWR_PCONP_PCI2S      ((uint32_t)(1<<27))

/** SD card interface power/clock control bit */
#define CLKPWR_PCONP_PCSDC      ((uint32_t)(1<<28))

/** GP DMA function power/clock control bit*/
#define  CLKPWR_PCONP_PCGPDMA   ((uint32_t)(1<<29))

/** Ethernet block power/clock control bit*/
#define  CLKPWR_PCONP_PCENET    ((uint32_t)(1<<30))

/** USB interface power/clock control bit*/
#define  CLKPWR_PCONP_PCUSB     ((uint32_t)(1<<31))


/*
 * ==========================================================================
 * ---------- Interrupt Number Definition -----------------------------------
 * ==========================================================================
 */

typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ***************************************************/
  NonMaskableInt_IRQn           = -14,      /*!< 2 Non Maskable Interrupt                         */
  MemoryManagement_IRQn         = -12,      /*!< 4 Cortex-M3 Memory Management Interrupt          */
  BusFault_IRQn                 = -11,      /*!< 5 Cortex-M3 Bus Fault Interrupt                  */
  UsageFault_IRQn               = -10,      /*!< 6 Cortex-M3 Usage Fault Interrupt                */
  SVCall_IRQn                   = -5,       /*!< 11 Cortex-M3 SV Call Interrupt                   */
  DebugMonitor_IRQn             = -4,       /*!< 12 Cortex-M3 Debug Monitor Interrupt             */
  PendSV_IRQn                   = -2,       /*!< 14 Cortex-M3 Pend SV Interrupt                   */
  SysTick_IRQn                  = -1,       /*!< 15 Cortex-M3 System Tick Interrupt               */

/******  LPC177x_8x Specific Interrupt Numbers *******************************************************/
  WDT_IRQn                      = 0,        /*!< Watchdog Timer Interrupt                         */
  TIMER0_IRQn                   = 1,        /*!< Timer0 Interrupt                                 */
  TIMER1_IRQn                   = 2,        /*!< Timer1 Interrupt                                 */
  TIMER2_IRQn                   = 3,        /*!< Timer2 Interrupt                                 */
  TIMER3_IRQn                   = 4,        /*!< Timer3 Interrupt                                 */
  UART0_IRQn                    = 5,        /*!< UART0 Interrupt                                  */
  UART1_IRQn                    = 6,        /*!< UART1 Interrupt                                  */
  UART2_IRQn                    = 7,        /*!< UART2 Interrupt                                  */
  UART3_IRQn                    = 8,        /*!< UART3 Interrupt                                  */
  PWM1_IRQn                     = 9,        /*!< PWM1 Interrupt                                   */
  I2C0_IRQn                     = 10,       /*!< I2C0 Interrupt                                   */
  I2C1_IRQn                     = 11,       /*!< I2C1 Interrupt                                   */
  I2C2_IRQn                     = 12,       /*!< I2C2 Interrupt                                   */
  Reserved0_IRQn                = 13,       /*!< Reserved                                         */
  SSP0_IRQn                     = 14,       /*!< SSP0 Interrupt                                   */
  SSP1_IRQn                     = 15,       /*!< SSP1 Interrupt                                   */
  PLL0_IRQn                     = 16,       /*!< PLL0 Lock (Main PLL) Interrupt                   */
  RTC_IRQn                      = 17,       /*!< Real Time Clock Interrupt                        */
  EINT0_IRQn                    = 18,       /*!< External Interrupt 0 Interrupt                   */
  EINT1_IRQn                    = 19,       /*!< External Interrupt 1 Interrupt                   */
  EINT2_IRQn                    = 20,       /*!< External Interrupt 2 Interrupt                   */
  EINT3_IRQn                    = 21,       /*!< External Interrupt 3 Interrupt                   */
  ADC_IRQn                      = 22,       /*!< A/D Converter Interrupt                          */
  BOD_IRQn                      = 23,       /*!< Brown-Out Detect Interrupt                       */
  USB_IRQn                      = 24,       /*!< USB Interrupt                                    */
  CAN_IRQn                      = 25,       /*!< CAN Interrupt                                    */
  DMA_IRQn                      = 26,       /*!< General Purpose DMA Interrupt                    */
  I2S_IRQn                      = 27,       /*!< I2S Interrupt                                    */
  ENET_IRQn                     = 28,       /*!< Ethernet Interrupt                               */
  MCI_IRQn                      = 29,       /*!< SD/MMC card I/F Interrupt                        */
  MCPWM_IRQn                    = 30,       /*!< Motor Control PWM Interrupt                      */
  QEI_IRQn                      = 31,       /*!< Quadrature Encoder Interface Interrupt           */
  PLL1_IRQn                     = 32,       /*!< PLL1 Lock (USB PLL) Interrupt                    */
  USBActivity_IRQn              = 33,       /*!< USB Activity interrupt                           */
  CANActivity_IRQn              = 34,       /*!< CAN Activity interrupt                           */
  UART4_IRQn                    = 35,       /*!< UART4 Interrupt                                  */
  SSP2_IRQn                     = 36,       /*!< SSP2 Interrupt                                   */
  LCD_IRQn                      = 37,       /*!< LCD Interrupt                                    */
  GPIO_IRQn                     = 38,       /*!< GPIO Interrupt                                   */
  PWM0_IRQn                     = 39,       /*!< PWM0 Interrupt                                   */
  EEPROM_IRQn                   = 40,       /*!< EEPROM Interrupt                           */
} IRQn_Type;


